; domain
(define
	(domain travellingsalesmancost)
	(:requirements :strips :typing :action-costs)
	(:types
		city
	)
	(:predicates
		(connected ?city1 - city ?city2 - city)
		(current ?city - city)
		(visited ?city - city)
	)
	(:functions
		(distance ?from- - city ?to - city) - number
		(total-cost) - number)

	(:action move
		:parameters (?from- - city ?to - city)
		:precondition (and (current ?from-) (connected ?from- ?to) (not (visited ?to)))
		:effect (and (not (current ?from-)) (current ?to) (visited ?to) (increase (total-cost) (distance ?from- ?to)))
	)
)

; problem
(define
	(problem travellingsalesmancost)
	(:domain travellingsalesmancost)
	(:objects
		AB AR AG BC BH BN BT BV BR B BZ CS CL CJ CT CV DB DJ GL GR GJ HR HD IL IS IF MM MH MS NT OT PH SM SJ SB SV TR TM TL VS VL VN - city
	)
	(:init (current TM) (visited TM) (connected TM AR) (connected TM HD) (connected TM CS) (connected AR TM) (connected AR HD) (connected AR AB) (connected AR BH) (connected BH AR) (connected BH AB) (connected BH CJ) (connected BH SJ) (connected BH SM) (connected SM BH) (connected SM SJ) (connected SM MM) (connected MM SM) (connected MM SJ) (connected MM CJ) (connected MM BN) (connected MM SV) (connected SJ SM) (connected SJ BH) (connected SJ CJ) (connected SJ MM) (connected CJ SJ) (connected CJ BH) (connected CJ AB) (connected CJ MS) (connected CJ BN) (connected CJ MM) (connected AB CJ) (connected AB BH) (connected AB AR) (connected AB HD) (connected AB VL) (connected AB SB) (connected AB MS) (connected HD AB) (connected HD AR) (connected HD TM) (connected HD CS) (connected HD GJ) (connected HD VL) (connected CS HD) (connected CS TM) (connected CS MH) (connected CS GJ) (connected MH CS) (connected MH GJ) (connected MH DJ) (connected DJ MH) (connected DJ GJ) (connected DJ VL) (connected DJ OT) (connected GJ DJ) (connected GJ MH) (connected GJ CS) (connected GJ HD) (connected GJ VL) (connected VL GJ) (connected VL HD) (connected VL AB) (connected VL SB) (connected VL AG) (connected VL OT) (connected VL DJ) (connected SB VL) (connected SB AB) (connected SB MS) (connected SB BV) (connected SB AG) (connected MS SB) (connected MS AB) (connected MS CJ) (connected MS BN) (connected MS SV) (connected MS HR) (connected MS BV) (connected BN MM) (connected BN CJ) (connected BN MS) (connected BN SV) (connected SV MM) (connected SV BN) (connected SV HR) (connected SV NT) (connected SV IS) (connected SV BT) (connected HR SV) (connected HR MS) (connected HR BV) (connected HR CV) (connected HR BC) (connected HR NT) (connected BV MS) (connected BV SB) (connected BV AG) (connected BV DB) (connected BV PH) (connected BV BZ) (connected BV CV) (connected BV HR) (connected AG BV) (connected AG SB) (connected AG VL) (connected AG OT) (connected AG TR) (connected AG DB) (connected OT DJ) (connected OT VL) (connected OT AG) (connected OT TR) (connected TR OT) (connected TR AG) (connected TR DB) (connected TR GR) (connected DB AG) (connected DB BV) (connected DB PH) (connected DB IF) (connected DB B) (connected DB GR) (connected DB TR) (connected GR TR) (connected GR DB) (connected GR B) (connected GR CL) (connected B GR) (connected B IF) (connected B DB) (connected B CL) (connected IF B) (connected IF DB) (connected IF PH) (connected IF IL) (connected IF CL) (connected PH DB) (connected PH IF) (connected PH IL) (connected PH BZ) (connected PH BV) (connected CV BV) (connected CV HR) (connected CV BC) (connected CV VN) (connected CV BZ) (connected BT SV) (connected BT IS) (connected NT SV) (connected NT HR) (connected NT BC) (connected NT VS) (connected NT IS) (connected IS BT) (connected IS SV) (connected IS NT) (connected IS VS) (connected BC NT) (connected BC VS) (connected BC VN) (connected BC CV) (connected BC HR) (connected VS IS) (connected VS NT) (connected VS BC) (connected VS VN) (connected VS GL) (connected VN BC) (connected VN CV) (connected VN BZ) (connected VN BR) (connected VN GL) (connected VN VS) (connected GL VS) (connected GL VN) (connected GL BR) (connected GL TL) (connected BZ VN) (connected BZ CV) (connected BZ BV) (connected BZ PH) (connected BZ IL) (connected BZ BR) (connected BR GL) (connected BR VN) (connected BR BZ) (connected BR IL) (connected BR CT) (connected BR TL) (connected TL GL) (connected TL BR) (connected TL CT) (connected IL BR) (connected IL BZ) (connected IL PH) (connected IL IF) (connected IL CL) (connected IL BR) (connected IL CT) (connected CL CT) (connected CL IL) (connected CL B) (connected CL IF) (connected CL GR) (connected CT TL) (connected CT BR) (connected CT IL) (connected CT CL)
		(= (total-cost) 0)
		(= (DISTANCE TM AR) 59)
		(= (DISTANCE TM HD) 154)
		(= (DISTANCE TM CS) 96)
		(= (DISTANCE AR TM) 59)
		(= (DISTANCE AR HD) 157)
		(= (DISTANCE AR AB) 175)
		(= (DISTANCE AR BH) 117)
		(= (DISTANCE BH AR) 117)
		(= (DISTANCE BH AB) 169)
		(= (DISTANCE BH CJ) 134)
		(= (DISTANCE BH SJ) 87)
		(= (DISTANCE BH SM) 109)
		(= (DISTANCE SM BH) 109)
		(= (DISTANCE SM SJ) 68)
		(= (DISTANCE SM MM) 54)
		(= (DISTANCE MM SM) 54)
		(= (DISTANCE MM SJ) 64)
		(= (DISTANCE MM CJ) 99)
		(= (DISTANCE MM BN) 91)
		(= (DISTANCE MM SV) 201)
		(= (DISTANCE SJ SM) 68)
		(= (DISTANCE SJ BH) 87)
		(= (DISTANCE SJ CJ) 65)
		(= (DISTANCE SJ MM) 64)
		(= (DISTANCE CJ SJ) 65)
		(= (DISTANCE CJ BH) 134)
		(= (DISTANCE CJ AB) 78)
		(= (DISTANCE CJ MS) 76)
		(= (DISTANCE CJ BN) 78)
		(= (DISTANCE CJ MM) 99)
		(= (DISTANCE AB CJ) 78)
		(= (DISTANCE AB BH) 169)
		(= (DISTANCE AB AR) 175)
		(= (DISTANCE AB HD) 55)
		(= (DISTANCE AB VL) 124)
		(= (DISTANCE AB SB) 52)
		(= (DISTANCE AB MS) 92)
		(= (DISTANCE HD AB) 55)
		(= (DISTANCE HD AR) 157)
		(= (DISTANCE HD TM) 154)
		(= (DISTANCE HD CS) 103)
		(= (DISTANCE HD GJ) 98)
		(= (DISTANCE HD VL) 143)
		(= (DISTANCE CS HD) 103)
		(= (DISTANCE CS TM) 96)
		(= (DISTANCE CS MH) 96)
		(= (DISTANCE CS GJ) 113)
		(= (DISTANCE MH CS) 96)
		(= (DISTANCE MH GJ) 66)
		(= (DISTANCE MH DJ) 97)
		(= (DISTANCE DJ MH) 97)
		(= (DISTANCE DJ GJ) 90)
		(= (DISTANCE DJ VL) 99)
		(= (DISTANCE DJ OT) 47)
		(= (DISTANCE GJ DJ) 90)
		(= (DISTANCE GJ MH) 66)
		(= (DISTANCE GJ CS) 113)
		(= (DISTANCE GJ HD) 98)
		(= (DISTANCE GJ VL) 87)
		(= (DISTANCE VL GJ) 87)
		(= (DISTANCE VL HD) 143)
		(= (DISTANCE VL AB) 124)
		(= (DISTANCE VL SB) 80)
		(= (DISTANCE VL AG) 47)
		(= (DISTANCE VL OT) 75)
		(= (DISTANCE VL DJ) 99)
		(= (DISTANCE SB VL) 80)
		(= (DISTANCE SB AB) 52)
		(= (DISTANCE SB MS) 89)
		(= (DISTANCE SB BV) 116)
		(= (DISTANCE SB AG) 119)
		(= (DISTANCE MS SB) 89)
		(= (DISTANCE MS AB) 92)
		(= (DISTANCE MS CJ) 89)
		(= (DISTANCE MS BN) 66)
		(= (DISTANCE MS SV) 153)
		(= (DISTANCE MS HR) 96)
		(= (DISTANCE MS BV) 141)
		(= (DISTANCE BN MM) 91)
		(= (DISTANCE BN CJ) 78)
		(= (DISTANCE BN MS) 66)
		(= (DISTANCE BN SV) 143)
		(= (DISTANCE SV MM) 201)
		(= (DISTANCE SV BN) 143)
		(= (DISTANCE SV HR) 147)
		(= (DISTANCE SV NT) 79)
		(= (DISTANCE SV IS) 114)
		(= (DISTANCE SV BT) 34)
		(= (DISTANCE HR SV) 147)
		(= (DISTANCE HR MS) 96)
		(= (DISTANCE HR BV) 79)
		(= (DISTANCE HR CV) 54)
		(= (DISTANCE HR BC) 89)
		(= (DISTANCE HR NT) 78)
		(= (DISTANCE BV MS) 141)
		(= (DISTANCE BV SB) 116)
		(= (DISTANCE BV AG) 105)
		(= (DISTANCE BV DB) 81)
		(= (DISTANCE BV PH) 84)
		(= (DISTANCE BV BZ) 111)
		(= (DISTANCE BV CV) 28)
		(= (DISTANCE BV HR) 79)
		(= (DISTANCE AG BV) 105)
		(= (DISTANCE AG SB) 119)
		(= (DISTANCE AG VL) 47)
		(= (DISTANCE AG OT) 61)
		(= (DISTANCE AG TR) 103)
		(= (DISTANCE AG DB) 48)
		(= (DISTANCE OT DJ) 47)
		(= (DISTANCE OT VL) 75)
		(= (DISTANCE OT AG) 61)
		(= (DISTANCE OT TR) 92)
		(= (DISTANCE TR OT) 92)
		(= (DISTANCE TR AG) 103)
		(= (DISTANCE TR DB) 105)
		(= (DISTANCE TR GR) 52)
		(= (DISTANCE DB AG) 48)
		(= (DISTANCE DB BV) 81)
		(= (DISTANCE DB PH) 44)
		(= (DISTANCE DB IF) 42)
		(= (DISTANCE DB B) 50)
		(= (DISTANCE DB GR) 119)
		(= (DISTANCE DB TR) 120)
		(= (DISTANCE GR TR) 52)
		(= (DISTANCE GR DB) 119)
		(= (DISTANCE GR B) 69)
		(= (DISTANCE GR CL) 92)
		(= (DISTANCE B GR) 69)
		(= (DISTANCE B IF) 11)
		(= (DISTANCE B DB) 50)
		(= (DISTANCE B CL) 78)
		(= (DISTANCE IF B) 11)
		(= (DISTANCE IF DB) 42)
		(= (DISTANCE IF PH) 43)
		(= (DISTANCE IF IL) 95)
		(= (DISTANCE IF CL) 102)
		(= (DISTANCE PH DB) 44)
		(= (DISTANCE PH IF) 43)
		(= (DISTANCE PH IL) 115)
		(= (DISTANCE PH BZ) 68)
		(= (DISTANCE PH BV) 84)
		(= (DISTANCE CV BV) 28)
		(= (DISTANCE CV HR) 54)
		(= (DISTANCE CV BC) 116)
		(= (DISTANCE CV VN) 110)
		(= (DISTANCE CV BZ) 114)
		(= (DISTANCE BT SV) 34)
		(= (DISTANCE BT IS) 95)
		(= (DISTANCE NT SV) 79)
		(= (DISTANCE NT HR) 78)
		(= (DISTANCE NT BC) 59)
		(= (DISTANCE NT VS) 109)
		(= (DISTANCE NT IS) 95)
		(= (DISTANCE IS BT) 95)
		(= (DISTANCE IS SV) 114)
		(= (DISTANCE IS NT) 95)
		(= (DISTANCE IS VS) 60)
		(= (DISTANCE BC NT) 59)
		(= (DISTANCE BC VS) 63)
		(= (DISTANCE BC VN) 99)
		(= (DISTANCE BC CV) 116)
		(= (DISTANCE BC HR) 89)
		(= (DISTANCE VS IS) 60)
		(= (DISTANCE VS NT) 109)
		(= (DISTANCE VS BC) 63)
		(= (DISTANCE VS VN) 112)
		(= (DISTANCE VS GL) 134)
		(= (DISTANCE VN BC) 99)
		(= (DISTANCE VN CV) 110)
		(= (DISTANCE VN BZ) 67)
		(= (DISTANCE VN BR) 79)
		(= (DISTANCE VN GL) 73)
		(= (DISTANCE VN VS) 112)
		(= (DISTANCE GL VS) 134)
		(= (DISTANCE GL VN) 73)
		(= (DISTANCE GL BR) 21)
		(= (DISTANCE GL TL) 67)
		(= (DISTANCE BZ VN) 67)
		(= (DISTANCE BZ CV) 114)
		(= (DISTANCE BZ BV) 111)
		(= (DISTANCE BZ PH) 68)
		(= (DISTANCE BZ IL) 77)
		(= (DISTANCE BZ BR) 91)
		(= (DISTANCE BR GL) 21)
		(= (DISTANCE BR VN) 79)
		(= (DISTANCE BR BZ) 91)
		(= (DISTANCE BR IL) 92)
		(= (DISTANCE BR CT) 133)
		(= (DISTANCE BR TL) 66)
		(= (DISTANCE TL GL) 67)
		(= (DISTANCE TL BR) 66)
		(= (DISTANCE TL CT) 111)
		(= (DISTANCE IL BR) 92)
		(= (DISTANCE IL BZ) 77)
		(= (DISTANCE IL PH) 115)
		(= (DISTANCE IL IF) 95)
		(= (DISTANCE IL CL) 45)
		(= (DISTANCE IL BR) 92)
		(= (DISTANCE IL CT) 111)
		(= (DISTANCE CL CT) 132)
		(= (DISTANCE CL IL) 45)
		(= (DISTANCE CL B) 78)
		(= (DISTANCE CL IF) 102)
		(= (DISTANCE CL GR) 92)
		(= (DISTANCE CT TL) 111)
		(= (DISTANCE CT BR) 133)
		(= (DISTANCE CT IL) 111)
		(= (DISTANCE CT CL) 132)
	)
	(:goal (and (visited AB) (visited AR) (visited AG) (visited BC) (visited BH) (visited BN) (visited BT) (visited BV) (visited BR) (visited B) (visited BZ) (visited CS) (visited CL) (visited CJ) (visited CT) (visited CV) (visited DB) (visited DJ) (visited GL) (visited GR) (visited GJ) (visited HR) (visited HD) (visited IL) (visited IS) (visited IF) (visited MM) (visited MH) (visited MS) (visited NT) (visited OT) (visited PH) (visited SM) (visited SJ) (visited SB) (visited SV) (visited TR) (visited TM) (visited TL) (visited VS) (visited VL) (visited VN)))
	(:metric minimize (total-cost))
)

; plan
1. (move tm cs)
   deleted: (current tm)
   added: (current cs) (visited cs)
   goals met: 2 of 42
2. (move cs mh)
   deleted: (current cs)
   added: (current mh) (visited mh)
   goals met: 3 of 42
3. (move mh dj)
   deleted: (current mh)
   added: (current dj) (visited dj)
   goals met: 4 of 42
4. (move dj ot)
   deleted: (current dj)
   added: (current ot) (visited ot)
   goals met: 5 of 42
5. (move ot vl)
   deleted: (current ot)
   added: (current vl) (visited vl)
   goals met: 6 of 42
6. (move vl ag)
   deleted: (current vl)
   added: (current ag) (visited ag)
   goals met: 7 of 42
7. (move ag tr)
   deleted: (current ag)
   added: (current tr) (visited tr)
   goals met: 8 of 42
8. (move tr gr)
   deleted: (current tr)
   added: (current gr) (visited gr)
   goals met: 9 of 42
9. (move gr b)
   deleted: (current gr)
   added: (current b) (visited b)
   goals met: 10 of 42
10. (move b if)
   deleted: (current b)
   added: (current if) (visited if)
   goals met: 11 of 42
11. (move if db)
   deleted: (current if)
   added: (current db) (visited db)
   goals met: 12 of 42
12. (move db ph)
   deleted: (current db)
   added: (current ph) (visited ph)
   goals met: 13 of 42
13. (move ph bz)
   deleted: (current ph)
   added: (current bz) (visited bz)
   goals met: 14 of 42
14. (move bz il)
   deleted: (current bz)
   added: (current il) (visited il)
   goals met: 15 of 42
15. (move il cl)
   deleted: (current il)
   added: (current cl) (visited cl)
   goals met: 16 of 42
16. (move cl ct)
   deleted: (current cl)
   added: (current ct) (visited ct)
   goals met: 17 of 42
17. (move ct tl)
   deleted: (current ct)
   added: (current tl) (visited tl)
   goals met: 18 of 42
18. (move tl br)
   deleted: (current tl)
   added: (current br) (visited br)
   goals met: 19 of 42
19. (move br gl)
   deleted: (current br)
   added: (current gl) (visited gl)
   goals met: 20 of 42
20. (move gl vn)
   deleted: (current gl)
   added: (current vn) (visited vn)
   goals met: 21 of 42
21. (move vn cv)
   deleted: (current vn)
   added: (current cv) (visited cv)
   goals met: 22 of 42
22. (move cv bv)
   deleted: (current cv)
   added: (current bv) (visited bv)
   goals met: 23 of 42
23. (move bv hr)
   deleted: (current bv)
   added: (current hr) (visited hr)
   goals met: 24 of 42
24. (move hr nt)
   deleted: (current hr)
   added: (current nt) (visited nt)
   goals met: 25 of 42
25. (move nt bc)
   deleted: (current nt)
   added: (current bc) (visited bc)
   goals met: 26 of 42
26. (move bc vs)
   deleted: (current bc)
   added: (current vs) (visited vs)
   goals met: 27 of 42
27. (move vs is)
   deleted: (current vs)
   added: (current is) (visited is)
   goals met: 28 of 42
28. (move is bt)
   deleted: (current is)
   added: (current bt) (visited bt)
   goals met: 29 of 42
29. (move bt sv)
   deleted: (current bt)
   added: (current sv) (visited sv)
   goals met: 30 of 42
30. (move sv bn)
   deleted: (current sv)
   added: (current bn) (visited bn)
   goals met: 31 of 42
31. (move bn ms)
   deleted: (current bn)
   added: (current ms) (visited ms)
   goals met: 32 of 42
32. (move ms sb)
   deleted: (current ms)
   added: (current sb) (visited sb)
   goals met: 33 of 42
33. (move sb ab)
   deleted: (current sb)
   added: (current ab) (visited ab)
   goals met: 34 of 42
34. (move ab cj)
   deleted: (current ab)
   added: (current cj) (visited cj)
   goals met: 35 of 42
35. (move cj sj)
   deleted: (current cj)
   added: (current sj) (visited sj)
   goals met: 36 of 42
36. (move sj mm)
   deleted: (current sj)
   added: (current mm) (visited mm)
   goals met: 37 of 42
37. (move mm sm)
   deleted: (current mm)
   added: (current sm) (visited sm)
   goals met: 38 of 42
38. (move sm bh)
   deleted: (current sm)
   added: (current bh) (visited bh)
   goals met: 39 of 42
39. (move bh ar)
   deleted: (current bh)
   added: (current ar) (visited ar)
   goals met: 40 of 42
40. (move ar hd)
   deleted: (current ar)
   added: (current hd) (visited hd)
   goals met: 41 of 42
41. (move hd gj)
   deleted: (current hd)
   added: (current gj) (visited gj)
   goals met: 42 of 42
